l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_blecore.h
    *prndinit = (localVal & ((uint32_t)0x80000000)) >> 31;
    *prndval = (localVal & ((uint32_t)0x003FFFFF)) >> 0;
}

__INLINE uint8_t ble_prnd_init_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RAL_PEER_RND_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void ble_prnd_init_setf(uint8_t prndinit)
{
    ASSERT_ERR((((uint32_t)prndinit << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_BLE_WR(BLE_RAL_PEER_RND_ADDR, (REG_BLE_RD(BLE_RAL_PEER_RND_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)prndinit << 31));
}

__INLINE uint32_t ble_prnd_val_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RAL_PEER_RND_ADDR);
    return ((localVal & ((uint32_t)0x003FFFFF)) >> 0);
}

__INLINE void ble_prnd_val_setf(uint32_t prndval)
{
    ASSERT_ERR((((uint32_t)prndval << 0) & ~((uint32_t)0x003FFFFF)) == 0);
    REG_BLE_WR(BLE_RAL_PEER_RND_ADDR, (REG_BLE_RD(BLE_RAL_PEER_RND_ADDR) & ~((uint32_t)0x003FFFFF)) | ((uint32_t)prndval << 0));
}

/**
 * @brief ISOCHANCNTL0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     04           RETXACKEN0   0
 *     03             SYNCGEN0   0
 *     02           ISOCHANEN0   0
 *  01:00             ISOTYPE0   0x0
 * </pre>
 */
#define BLE_ISOCHANCNTL0_ADDR   0x00810150
#define BLE_ISOCHANCNTL0_OFFSET 0x00000150
#define BLE_ISOCHANCNTL0_INDEX  0x00000054
#define BLE_ISOCHANCNTL0_RESET  0x00000000

__INLINE uint32_t ble_isochancntl0_get(void)
{
    return REG_BLE_RD(BLE_ISOCHANCNTL0_ADDR);
}

__INLINE void ble_isochancntl0_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOCHANCNTL0_ADDR, value);
}

// field definitions
#define BLE_RETXACKEN0_BIT    ((uint32_t)0x00000010)
#define BLE_RETXACKEN0_POS    4
#define BLE_SYNCGEN0_BIT      ((uint32_t)0x00000008)
#define BLE_SYNCGEN0_POS      3
#define BLE_ISOCHANEN0_BIT    ((uint32_t)0x00000004)
#define BLE_ISOCHANEN0_POS    2
#define BLE_ISOTYPE0_MASK     ((uint32_t)0x00000003)
#define BLE_ISOTYPE0_LSB      0
#define BLE_ISOTYPE0_WIDTH    ((uint32_t)0x00000002)

#define BLE_RETXACKEN0_RST    0x0
#define BLE_SYNCGEN0_RST      0x0
#define BLE_ISOCHANEN0_RST    0x0
#define BLE_ISOTYPE0_RST      0x0

__INLINE void ble_isochancntl0_pack(uint8_t retxacken0, uint8_t syncgen0, uint8_t isochanen0, uint8_t isotype0)
{
    ASSERT_ERR((((uint32_t)retxacken0 << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)syncgen0 << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)isochanen0 << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)isotype0 << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL0_ADDR,  ((uint32_t)retxacken0 << 4) | ((uint32_t)syncgen0 << 3) | ((uint32_t)isochanen0 << 2) | ((uint32_t)isotype0 << 0));
}

__INLINE void ble_isochancntl0_unpack(uint8_t* retxacken0, uint8_t* syncgen0, uint8_t* isochanen0, uint8_t* isotype0)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL0_ADDR);

    *retxacken0 = (localVal & ((uint32_t)0x00000010)) >> 4;
    *syncgen0 = (localVal & ((uint32_t)0x00000008)) >> 3;
    *isochanen0 = (localVal & ((uint32_t)0x00000004)) >> 2;
    *isotype0 = (localVal & ((uint32_t)0x00000003)) >> 0;
}

__INLINE uint8_t ble_retxacken0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void ble_retxacken0_setf(uint8_t retxacken0)
{
    ASSERT_ERR((((uint32_t)retxacken0 << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL0_ADDR, (REG_BLE_RD(BLE_ISOCHANCNTL0_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)retxacken0 << 4));
}

__INLINE uint8_t ble_syncgen0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void ble_syncgen0_setf(uint8_t syncgen0)
{
    ASSERT_ERR((((uint32_t)syncgen0 << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL0_ADDR, (REG_BLE_RD(BLE_ISOCHANCNTL0_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)syncgen0 << 3));
}

__INLINE uint8_t ble_isochanen0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void ble_isochanen0_setf(uint8_t isochanen0)
{
    ASSERT_ERR((((uint32_t)isochanen0 << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL0_ADDR, (REG_BLE_RD(BLE_ISOCHANCNTL0_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)isochanen0 << 2));
}

__INLINE uint8_t ble_isotype0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000003)) >> 0);
}

__INLINE void ble_isotype0_setf(uint8_t isotype0)
{
    ASSERT_ERR((((uint32_t)isotype0 << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL0_ADDR, (REG_BLE_RD(BLE_ISOCHANCNTL0_ADDR) & ~((uint32_t)0x00000003)) | ((uint32_t)isotype0 << 0));
}

/**
 * @brief ISOMUTECNTL0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31                 TOG0   0
 *     19           MUTE_SINK0   0
 *     18         MUTE_SOURCE0   0
 *     17              INVL0_1   1
 *     16              INVL0_0   1
 *  07:00        MUTE_PATTERN0   0x0
 * </pre>
 */
#define BLE_ISOMUTECNTL0_ADDR   0x00810154
#define BLE_ISOMUTECNTL0_OFFSET 0x00000154
#define BLE_ISOMUTECNTL0_INDEX  0x00000055
#define BLE_ISOMUTECNTL0_RESET  0x00030000

__INLINE uint32_t ble_isomutecntl0_get(void)
{
    return REG_BLE_RD(BLE_ISOMUTECNTL0_ADDR);
}

__INLINE void ble_isomutecntl0_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOMUTECNTL0_ADDR, value);
}

// field definitions
#define BLE_TOG0_BIT             ((uint32_t)0x80000000)
#define BLE_TOG0_POS             31
#define BLE_MUTE_SINK0_BIT       ((uint32_t)0x00080000)
#define BLE_MUTE_SINK0_POS       19
#define BLE_MUTE_SOURCE0_BIT     ((uint32_t)0x00040000)
#define BLE_MUTE_SOURCE0_POS     18
#define BLE_INVL0_1_BIT          ((uint32_t)0x00020000)
#define BLE_INVL0_1_POS          17
#define BLE_INVL0_0_BIT          ((uint32_t)0x00010000)
#define BLE_INVL0_0_POS          16
#define BLE_MUTE_PATTERN0_MASK   ((uint32_t)0x000000FF)
#define BLE_MUTE_PATTERN0_LSB    0
#define BLE_MUTE_PATTERN0_WIDTH  ((uint32_t)0x00000008)

