l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_blecore.h
#define BLE_TOG0_RST             0x0
#define BLE_MUTE_SINK0_RST       0x0
#define BLE_MUTE_SOURCE0_RST     0x0
#define BLE_INVL0_1_RST          0x1
#define BLE_INVL0_0_RST          0x1
#define BLE_MUTE_PATTERN0_RST    0x0

__INLINE void ble_isomutecntl0_pack(uint8_t mutesink0, uint8_t mutesource0, uint8_t invl01, uint8_t invl00, uint8_t mutepattern0)
{
    ASSERT_ERR((((uint32_t)mutesink0 << 19) & ~((uint32_t)0x00080000)) == 0);
    ASSERT_ERR((((uint32_t)mutesource0 << 18) & ~((uint32_t)0x00040000)) == 0);
    ASSERT_ERR((((uint32_t)invl01 << 17) & ~((uint32_t)0x00020000)) == 0);
    ASSERT_ERR((((uint32_t)invl00 << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)mutepattern0 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL0_ADDR,  ((uint32_t)mutesink0 << 19) | ((uint32_t)mutesource0 << 18) | ((uint32_t)invl01 << 17) | ((uint32_t)invl00 << 16) | ((uint32_t)mutepattern0 << 0));
}

__INLINE void ble_isomutecntl0_unpack(uint8_t* tog0, uint8_t* mutesink0, uint8_t* mutesource0, uint8_t* invl01, uint8_t* invl00, uint8_t* mutepattern0)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL0_ADDR);

    *tog0 = (localVal & ((uint32_t)0x80000000)) >> 31;
    *mutesink0 = (localVal & ((uint32_t)0x00080000)) >> 19;
    *mutesource0 = (localVal & ((uint32_t)0x00040000)) >> 18;
    *invl01 = (localVal & ((uint32_t)0x00020000)) >> 17;
    *invl00 = (localVal & ((uint32_t)0x00010000)) >> 16;
    *mutepattern0 = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t ble_tog0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL0_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE uint8_t ble_mute_sink0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00080000)) >> 19);
}

__INLINE void ble_mute_sink0_setf(uint8_t mutesink0)
{
    ASSERT_ERR((((uint32_t)mutesink0 << 19) & ~((uint32_t)0x00080000)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL0_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL0_ADDR) & ~((uint32_t)0x00080000)) | ((uint32_t)mutesink0 << 19));
}

__INLINE uint8_t ble_mute_source0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

__INLINE void ble_mute_source0_setf(uint8_t mutesource0)
{
    ASSERT_ERR((((uint32_t)mutesource0 << 18) & ~((uint32_t)0x00040000)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL0_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL0_ADDR) & ~((uint32_t)0x00040000)) | ((uint32_t)mutesource0 << 18));
}

__INLINE uint8_t ble_invl0_1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00020000)) >> 17);
}

__INLINE void ble_invl0_1_setf(uint8_t invl01)
{
    ASSERT_ERR((((uint32_t)invl01 << 17) & ~((uint32_t)0x00020000)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL0_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL0_ADDR) & ~((uint32_t)0x00020000)) | ((uint32_t)invl01 << 17));
}

__INLINE uint8_t ble_invl0_0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__INLINE void ble_invl0_0_setf(uint8_t invl00)
{
    ASSERT_ERR((((uint32_t)invl00 << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL0_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL0_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)invl00 << 16));
}

__INLINE uint8_t ble_mute_pattern0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL0_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void ble_mute_pattern0_setf(uint8_t mutepattern0)
{
    ASSERT_ERR((((uint32_t)mutepattern0 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL0_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL0_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)mutepattern0 << 0));
}

/**
 * @brief ISOCURRENTTXPTR0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:16           ISO0TXPTR1   0x0
 *  15:00           ISO0TXPTR0   0x0
 * </pre>
 */
#define BLE_ISOCURRENTTXPTR0_ADDR   0x00810158
#define BLE_ISOCURRENTTXPTR0_OFFSET 0x00000158
#define BLE_ISOCURRENTTXPTR0_INDEX  0x00000056
#define BLE_ISOCURRENTTXPTR0_RESET  0x00000000

__INLINE uint32_t ble_isocurrenttxptr0_get(void)
{
    return REG_BLE_RD(BLE_ISOCURRENTTXPTR0_ADDR);
}

__INLINE void ble_isocurrenttxptr0_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOCURRENTTXPTR0_ADDR, value);
}

// field definitions
#define BLE_ISO0TXPTR1_MASK   ((uint32_t)0xFFFF0000)
#define BLE_ISO0TXPTR1_LSB    16
#define BLE_ISO0TXPTR1_WIDTH  ((uint32_t)0x00000010)
#define BLE_ISO0TXPTR0_MASK   ((uint32_t)0x0000FFFF)
#define BLE_ISO0TXPTR0_LSB    0
#define BLE_ISO0TXPTR0_WIDTH  ((uint32_t)0x00000010)

#define BLE_ISO0TXPTR1_RST    0x0
#define BLE_ISO0TXPTR0_RST    0x0

__INLINE void ble_isocurrenttxptr0_pack(uint16_t iso0txptr1, uint16_t iso0txptr0)
{
    ASSERT_ERR((((uint32_t)iso0txptr1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    ASSERT_ERR((((uint32_t)iso0txptr0 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTTXPTR0_ADDR,  ((uint32_t)iso0txptr1 << 16) | ((uint32_t)iso0txptr0 << 0));
}

__INLINE void ble_isocurrenttxptr0_unpack(uint16_t* iso0txptr1, uint16_t* iso0txptr0)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTTXPTR0_ADDR);

    *iso0txptr1 = (localVal & ((uint32_t)0xFFFF0000)) >> 16;
    *iso0txptr0 = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

__INLINE uint16_t ble_iso0txptr1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTTXPTR0_ADDR);
    return ((localVal & ((uint32_t)0xFFFF0000)) >> 16);
}

__INLINE void ble_iso0txptr1_setf(uint16_t iso0txptr1)
{
    ASSERT_ERR((((uint32_t)iso0txptr1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTTXPTR0_ADDR, (REG_BLE_RD(BLE_ISOCURRENTTXPTR0_ADDR) & ~((uint32_t)0xFFFF0000)) | ((uint32_t)iso0txptr1 << 16));
}

__INLINE uint16_t ble_iso0txptr0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTTXPTR0_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

