l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_blecore.h
__INLINE void ble_iso0txptr0_setf(uint16_t iso0txptr0)
{
    ASSERT_ERR((((uint32_t)iso0txptr0 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTTXPTR0_ADDR, (REG_BLE_RD(BLE_ISOCURRENTTXPTR0_ADDR) & ~((uint32_t)0x0000FFFF)) | ((uint32_t)iso0txptr0 << 0));
}

/**
 * @brief ISOCURRENTRXPTR0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:16           ISO0RXPTR1   0x0
 *  15:00           ISO0RXPTR0   0x0
 * </pre>
 */
#define BLE_ISOCURRENTRXPTR0_ADDR   0x0081015C
#define BLE_ISOCURRENTRXPTR0_OFFSET 0x0000015C
#define BLE_ISOCURRENTRXPTR0_INDEX  0x00000057
#define BLE_ISOCURRENTRXPTR0_RESET  0x00000000

__INLINE uint32_t ble_isocurrentrxptr0_get(void)
{
    return REG_BLE_RD(BLE_ISOCURRENTRXPTR0_ADDR);
}

__INLINE void ble_isocurrentrxptr0_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOCURRENTRXPTR0_ADDR, value);
}

// field definitions
#define BLE_ISO0RXPTR1_MASK   ((uint32_t)0xFFFF0000)
#define BLE_ISO0RXPTR1_LSB    16
#define BLE_ISO0RXPTR1_WIDTH  ((uint32_t)0x00000010)
#define BLE_ISO0RXPTR0_MASK   ((uint32_t)0x0000FFFF)
#define BLE_ISO0RXPTR0_LSB    0
#define BLE_ISO0RXPTR0_WIDTH  ((uint32_t)0x00000010)

#define BLE_ISO0RXPTR1_RST    0x0
#define BLE_ISO0RXPTR0_RST    0x0

__INLINE void ble_isocurrentrxptr0_pack(uint16_t iso0rxptr1, uint16_t iso0rxptr0)
{
    ASSERT_ERR((((uint32_t)iso0rxptr1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    ASSERT_ERR((((uint32_t)iso0rxptr0 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTRXPTR0_ADDR,  ((uint32_t)iso0rxptr1 << 16) | ((uint32_t)iso0rxptr0 << 0));
}

__INLINE void ble_isocurrentrxptr0_unpack(uint16_t* iso0rxptr1, uint16_t* iso0rxptr0)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTRXPTR0_ADDR);

    *iso0rxptr1 = (localVal & ((uint32_t)0xFFFF0000)) >> 16;
    *iso0rxptr0 = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

__INLINE uint16_t ble_iso0rxptr1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTRXPTR0_ADDR);
    return ((localVal & ((uint32_t)0xFFFF0000)) >> 16);
}

__INLINE void ble_iso0rxptr1_setf(uint16_t iso0rxptr1)
{
    ASSERT_ERR((((uint32_t)iso0rxptr1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTRXPTR0_ADDR, (REG_BLE_RD(BLE_ISOCURRENTRXPTR0_ADDR) & ~((uint32_t)0xFFFF0000)) | ((uint32_t)iso0rxptr1 << 16));
}

__INLINE uint16_t ble_iso0rxptr0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTRXPTR0_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

__INLINE void ble_iso0rxptr0_setf(uint16_t iso0rxptr0)
{
    ASSERT_ERR((((uint32_t)iso0rxptr0 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTRXPTR0_ADDR, (REG_BLE_RD(BLE_ISOCURRENTRXPTR0_ADDR) & ~((uint32_t)0x0000FFFF)) | ((uint32_t)iso0rxptr0 << 0));
}

/**
 * @brief ISOTRCNTL0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:16            ISO0RXLEN   0x0
 *  07:00            ISO0TXLEN   0x0
 * </pre>
 */
#define BLE_ISOTRCNTL0_ADDR   0x00810160
#define BLE_ISOTRCNTL0_OFFSET 0x00000160
#define BLE_ISOTRCNTL0_INDEX  0x00000058
#define BLE_ISOTRCNTL0_RESET  0x00000000

__INLINE uint32_t ble_isotrcntl0_get(void)
{
    return REG_BLE_RD(BLE_ISOTRCNTL0_ADDR);
}

__INLINE void ble_isotrcntl0_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOTRCNTL0_ADDR, value);
}

// field definitions
#define BLE_ISO0RXLEN_MASK   ((uint32_t)0x00FF0000)
#define BLE_ISO0RXLEN_LSB    16
#define BLE_ISO0RXLEN_WIDTH  ((uint32_t)0x00000008)
#define BLE_ISO0TXLEN_MASK   ((uint32_t)0x000000FF)
#define BLE_ISO0TXLEN_LSB    0
#define BLE_ISO0TXLEN_WIDTH  ((uint32_t)0x00000008)

#define BLE_ISO0RXLEN_RST    0x0
#define BLE_ISO0TXLEN_RST    0x0

__INLINE void ble_isotrcntl0_pack(uint8_t iso0rxlen, uint8_t iso0txlen)
{
    ASSERT_ERR((((uint32_t)iso0rxlen << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)iso0txlen << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_ISOTRCNTL0_ADDR,  ((uint32_t)iso0rxlen << 16) | ((uint32_t)iso0txlen << 0));
}

__INLINE void ble_isotrcntl0_unpack(uint8_t* iso0rxlen, uint8_t* iso0txlen)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOTRCNTL0_ADDR);

    *iso0rxlen = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *iso0txlen = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t ble_iso0rxlen_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOTRCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void ble_iso0rxlen_setf(uint8_t iso0rxlen)
{
    ASSERT_ERR((((uint32_t)iso0rxlen << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_BLE_WR(BLE_ISOTRCNTL0_ADDR, (REG_BLE_RD(BLE_ISOTRCNTL0_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)iso0rxlen << 16));
}

__INLINE uint8_t ble_iso0txlen_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOTRCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void ble_iso0txlen_setf(uint8_t iso0txlen)
{
    ASSERT_ERR((((uint32_t)iso0txlen << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_ISOTRCNTL0_ADDR, (REG_BLE_RD(BLE_ISOTRCNTL0_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)iso0txlen << 0));
}

/**
 * @brief ISOEVTCNTOFFSETL0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00     EVT_CNT_OFFSETL0   0x0
 * </pre>
 */
#define BLE_ISOEVTCNTOFFSETL0_ADDR   0x00810164
#define BLE_ISOEVTCNTOFFSETL0_OFFSET 0x00000164
#define BLE_ISOEVTCNTOFFSETL0_INDEX  0x00000059
#define BLE_ISOEVTCNTOFFSETL0_RESET  0x00000000

__INLINE uint32_t ble_isoevtcntoffsetl0_get(void)
{
    return REG_BLE_RD(BLE_ISOEVTCNTOFFSETL0_ADDR);
}

__INLINE void ble_isoevtcntoffsetl0_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOEVTCNTOFFSETL0_ADDR, value);
}

// field definitions
#define BLE_EVT_CNT_OFFSETL0_MASK   ((uint32_t)0xFFFFFFFF)
#define BLE_EVT_CNT_OFFSETL0_LSB    0
#define BLE_EVT_CNT_OFFSETL0_WIDTH  ((uint32_t)0x00000020)

#define BLE_EVT_CNT_OFFSETL0_RST    0x0

__INLINE uint32_t ble_evt_cnt_offsetl0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOEVTCNTOFFSETL0_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void ble_evt_cnt_offsetl0_setf(uint32_t evtcntoffsetl0)
{
    ASSERT_ERR((((uint32_t)evtcntoffsetl0 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_BLE_WR(BLE_ISOEVTCNTOFFSETL0_ADDR, (uint32_t)evtcntoffsetl0 << 0);
}

/**
 * @brief ISOEVTCNTOFFSETU0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  06:00     EVT_CNT_OFFSETU0   0x0
 * </pre>
 */
#define BLE_ISOEVTCNTOFFSETU0_ADDR   0x00810168
#define BLE_ISOEVTCNTOFFSETU0_OFFSET 0x00000168
#define BLE_ISOEVTCNTOFFSETU0_INDEX  0x0000005A
#define BLE_ISOEVTCNTOFFSETU0_RESET  0x00000000

__INLINE uint32_t ble_isoevtcntoffsetu0_get(void)
{
    return REG_BLE_RD(BLE_ISOEVTCNTOFFSETU0_ADDR);
}

__INLINE void ble_isoevtcntoffsetu0_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOEVTCNTOFFSETU0_ADDR, value);
}

