l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_blecore.h
__INLINE uint8_t ble_tog2_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL2_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE uint8_t ble_mute_sink2_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00080000)) >> 19);
}

__INLINE void ble_mute_sink2_setf(uint8_t mutesink2)
{
    ASSERT_ERR((((uint32_t)mutesink2 << 19) & ~((uint32_t)0x00080000)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL2_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL2_ADDR) & ~((uint32_t)0x00080000)) | ((uint32_t)mutesink2 << 19));
}

__INLINE uint8_t ble_mute_source2_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

__INLINE void ble_mute_source2_setf(uint8_t mutesource2)
{
    ASSERT_ERR((((uint32_t)mutesource2 << 18) & ~((uint32_t)0x00040000)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL2_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL2_ADDR) & ~((uint32_t)0x00040000)) | ((uint32_t)mutesource2 << 18));
}

__INLINE uint8_t ble_invl2_1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00020000)) >> 17);
}

__INLINE void ble_invl2_1_setf(uint8_t invl21)
{
    ASSERT_ERR((((uint32_t)invl21 << 17) & ~((uint32_t)0x00020000)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL2_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL2_ADDR) & ~((uint32_t)0x00020000)) | ((uint32_t)invl21 << 17));
}

__INLINE uint8_t ble_invl2_0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__INLINE void ble_invl2_0_setf(uint8_t invl20)
{
    ASSERT_ERR((((uint32_t)invl20 << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL2_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL2_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)invl20 << 16));
}

__INLINE uint8_t ble_mute_pattern2_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL2_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void ble_mute_pattern2_setf(uint8_t mutepattern2)
{
    ASSERT_ERR((((uint32_t)mutepattern2 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL2_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL2_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)mutepattern2 << 0));
}

/**
 * @brief ISOCURRENTTXPTR2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:16           ISO2TXPTR1   0x0
 *  15:00           ISO2TXPTR0   0x0
 * </pre>
 */
#define BLE_ISOCURRENTTXPTR2_ADDR   0x00810198
#define BLE_ISOCURRENTTXPTR2_OFFSET 0x00000198
#define BLE_ISOCURRENTTXPTR2_INDEX  0x00000066
#define BLE_ISOCURRENTTXPTR2_RESET  0x00000000

__INLINE uint32_t ble_isocurrenttxptr2_get(void)
{
    return REG_BLE_RD(BLE_ISOCURRENTTXPTR2_ADDR);
}

__INLINE void ble_isocurrenttxptr2_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOCURRENTTXPTR2_ADDR, value);
}

// field definitions
#define BLE_ISO2TXPTR1_MASK   ((uint32_t)0xFFFF0000)
#define BLE_ISO2TXPTR1_LSB    16
#define BLE_ISO2TXPTR1_WIDTH  ((uint32_t)0x00000010)
#define BLE_ISO2TXPTR0_MASK   ((uint32_t)0x0000FFFF)
#define BLE_ISO2TXPTR0_LSB    0
#define BLE_ISO2TXPTR0_WIDTH  ((uint32_t)0x00000010)

#define BLE_ISO2TXPTR1_RST    0x0
#define BLE_ISO2TXPTR0_RST    0x0

__INLINE void ble_isocurrenttxptr2_pack(uint16_t iso2txptr1, uint16_t iso2txptr0)
{
    ASSERT_ERR((((uint32_t)iso2txptr1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    ASSERT_ERR((((uint32_t)iso2txptr0 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTTXPTR2_ADDR,  ((uint32_t)iso2txptr1 << 16) | ((uint32_t)iso2txptr0 << 0));
}

__INLINE void ble_isocurrenttxptr2_unpack(uint16_t* iso2txptr1, uint16_t* iso2txptr0)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTTXPTR2_ADDR);

    *iso2txptr1 = (localVal & ((uint32_t)0xFFFF0000)) >> 16;
    *iso2txptr0 = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

__INLINE uint16_t ble_iso2txptr1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTTXPTR2_ADDR);
    return ((localVal & ((uint32_t)0xFFFF0000)) >> 16);
}

__INLINE void ble_iso2txptr1_setf(uint16_t iso2txptr1)
{
    ASSERT_ERR((((uint32_t)iso2txptr1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTTXPTR2_ADDR, (REG_BLE_RD(BLE_ISOCURRENTTXPTR2_ADDR) & ~((uint32_t)0xFFFF0000)) | ((uint32_t)iso2txptr1 << 16));
}

__INLINE uint16_t ble_iso2txptr0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTTXPTR2_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

__INLINE void ble_iso2txptr0_setf(uint16_t iso2txptr0)
{
    ASSERT_ERR((((uint32_t)iso2txptr0 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTTXPTR2_ADDR, (REG_BLE_RD(BLE_ISOCURRENTTXPTR2_ADDR) & ~((uint32_t)0x0000FFFF)) | ((uint32_t)iso2txptr0 << 0));
}

/**
 * @brief ISOCURRENTRXPTR2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:16           ISO2RXPTR1   0x0
 *  15:00           ISO2RXPTR0   0x0
 * </pre>
 */
#define BLE_ISOCURRENTRXPTR2_ADDR   0x0081019C
#define BLE_ISOCURRENTRXPTR2_OFFSET 0x0000019C
#define BLE_ISOCURRENTRXPTR2_INDEX  0x00000067
#define BLE_ISOCURRENTRXPTR2_RESET  0x00000000

__INLINE uint32_t ble_isocurrentrxptr2_get(void)
{
    return REG_BLE_RD(BLE_ISOCURRENTRXPTR2_ADDR);
}

__INLINE void ble_isocurrentrxptr2_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOCURRENTRXPTR2_ADDR, value);
}

// field definitions
#define BLE_ISO2RXPTR1_MASK   ((uint32_t)0xFFFF0000)
#define BLE_ISO2RXPTR1_LSB    16
#define BLE_ISO2RXPTR1_WIDTH  ((uint32_t)0x00000010)
#define BLE_ISO2RXPTR0_MASK   ((uint32_t)0x0000FFFF)
#define BLE_ISO2RXPTR0_LSB    0
#define BLE_ISO2RXPTR0_WIDTH  ((uint32_t)0x00000010)

#define BLE_ISO2RXPTR1_RST    0x0
#define BLE_ISO2RXPTR0_RST    0x0

__INLINE void ble_isocurrentrxptr2_pack(uint16_t iso2rxptr1, uint16_t iso2rxptr0)
{
    ASSERT_ERR((((uint32_t)iso2rxptr1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    ASSERT_ERR((((uint32_t)iso2rxptr0 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTRXPTR2_ADDR,  ((uint32_t)iso2rxptr1 << 16) | ((uint32_t)iso2rxptr0 << 0));
}

__INLINE void ble_isocurrentrxptr2_unpack(uint16_t* iso2rxptr1, uint16_t* iso2rxptr0)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTRXPTR2_ADDR);

    *iso2rxptr1 = (localVal & ((uint32_t)0xFFFF0000)) >> 16;
    *iso2rxptr0 = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

__INLINE uint16_t ble_iso2rxptr1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTRXPTR2_ADDR);
    return ((localVal & ((uint32_t)0xFFFF0000)) >> 16);
}

__INLINE void ble_iso2rxptr1_setf(uint16_t iso2rxptr1)
{
    ASSERT_ERR((((uint32_t)iso2rxptr1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTRXPTR2_ADDR, (REG_BLE_RD(BLE_ISOCURRENTRXPTR2_ADDR) & ~((uint32_t)0xFFFF0000)) | ((uint32_t)iso2rxptr1 << 16));
}

__INLINE uint16_t ble_iso2rxptr0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTRXPTR2_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

__INLINE void ble_iso2rxptr0_setf(uint16_t iso2rxptr0)
{
    ASSERT_ERR((((uint32_t)iso2rxptr0 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTRXPTR2_ADDR, (REG_BLE_RD(BLE_ISOCURRENTRXPTR2_ADDR) & ~((uint32_t)0x0000FFFF)) | ((uint32_t)iso2rxptr0 << 0));
}

/**
 * @brief ISOTRCNTL2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:16            ISO2RXLEN   0x0
 *  07:00            ISO2TXLEN   0x0
 * </pre>
 */
#define BLE_ISOTRCNTL2_ADDR   0x008101A0
#define BLE_ISOTRCNTL2_OFFSET 0x000001A0
#define BLE_ISOTRCNTL2_INDEX  0x00000068
#define BLE_ISOTRCNTL2_RESET  0x00000000

__INLINE uint32_t ble_isotrcntl2_get(void)
{
    return REG_BLE_RD(BLE_ISOTRCNTL2_ADDR);
}

__INLINE void ble_isotrcntl2_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOTRCNTL2_ADDR, value);
}

